1C_config/src/Documents/ПлатежноеПоручение/ПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручение</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

1C_config/src/AccumulationRegisters/ОстаткиНаСчетах/ОстаткиНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1C_config/src/Enums/СтатусыПлатежа/СтатусыПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПлатежа</name>
  <enumValues>
    <name>План</name>
    <comment>заявка создана, но оплата еще не прошла</comment>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
    <comment>по документу уже есть проведенная платежка</comment>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
    <comment>для заявок, требующих утверждения</comment>
  </enumValues>
</mdclass:Enum>

1C_config/src/Documents/ПлатежноеПоручение/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    
    Дата = ТекущаяДата();
    
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Фиксируем пометку на удаление 
	Если ПометкаУдаления И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления Тогда
        Комментарий = "Платеж №" + Номер + " помечен на удаление";
        Журналирование.ЗаписатьДействие(Ссылка, "Пометка на удаление", Комментарий);
    КонецЕсли;
    
    // Фиксируем снятие пометки 
    Если Не ПометкаУдаления И Не ЭтоНовый() И Ссылка.ПометкаУдаления Тогда
        Комментарий = "Снята пометка удаления с платежа №" + Номер;
        Журналирование.ЗаписатьДействие(Ссылка, "Снятие пометки на удаление", Комментарий);
    КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // счета не должны совпадать
    Если СчетОтправителя = СчетПолучателя Тогда
        Отказ = Истина;
        Сообщить("Ошибка: счет отправителя и получателя должны быть разными");
        Возврат;
    КонецЕсли;
    

    Движения.ОстаткиНаСчетах.Очистить();
    
    Движение = Движения.ОстаткиНаСчетах.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Счет = СчетОтправителя;
    Движение.Сумма = Сумма;
    
    Движение = Движения.ОстаткиНаСчетах.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Счет = СчетПолучателя;
    Движение.Сумма = Сумма;
    
    Движения.ОстаткиНаСчетах.Записывать = Истина;
    
    // заполнено ли поле ДокументОснование
    Если ЗначениеЗаполнено(ДокументОснование) Тогда
        
        Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
            СчетОбъект = ДокументОснование.ПолучитьОбъект();
            СчетОбъект.Статус = Перечисления.СтатусыПлатежа.Исполнен;
            СчетОбъект.Записать();
        КонецЕсли;
        
        Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
            ЗаявкаОбъект = ДокументОснование.ПолучитьОбъект();
            ЗаявкаОбъект.Статус = Перечисления.СтатусыПлатежа.Исполнен;
            ЗаявкаОбъект.Записать();
        КонецЕсли;
        
    КонецЕсли;
    
    // Запись в журнал аудита
    Комментарий = "Платеж №" + Номер + " на сумму " + Сумма + " руб.";
    Журналирование.ЗаписатьДействие(Ссылка, "Проведение", Комментарий);
    
КонецПроцедуры

Процедура ОбработкаУдаления(Отказ, РежимУдаления)
    
    // Запись в аудит о физическом удалении
	Комментарий = "Платеж №" + Номер + " физически удален из базы";
    Журналирование.ЗаписатьДействие(Ссылка, "Физическое удаление", Комментарий);
    
КонецПроцедуры
